{
  "title": "Faces",
  "chapter": "",
  "author": "CaptainOfMySul517",
  "link": "https://www.reddit.com/r/scarystories/comments/1qrkep4/faces/",
  "description": "A boy starts to notice strange behavior from his mother after the divorce of his parents.",
  "text": "My hand is shaking so badly I almost drop it, and I can feel the pull in my shoulder as I stretch. I'm so close… just a little farther. I'm almost in position—boom! The Jenga tower crashes to the ground. Ma cheers, waving her arms in the worst victory dance I've ever seen. \"Time for bed,\" she says as she starts putting the blocks away. I groan and throw myself onto the floor. \"Just one more?\" I insist, starfishing my limbs on the carpet.\n\nShe’s already halfway to my room when she calls back, \"School night. I already let you stay up late to wait for the package from your dad.\" I have a coin collection I started three years ago, and Dad sends me coins from different places he travels.\n\n\"I'll win next time,\" I insist, even though I haven’t won a single game.\n\n\"Sure, sweetie,\" she hums, tucking the sheets under my chin.\n\nHuh. She’s never called me that before.\n\n***\n\nThe next day, Ma takes me to the park. I only have a couple of weeks left before summer, and school is so boring. I decide to see how fast I can get across the playscape without touching the ground. I make it across the monkey bars, but another kid swinging by knocks me down.\n\n\"Sorry!\" he yells as he runs off. I'm a little dazed, and my elbow is bleeding, but before I can start looking for Ma to get a bandage, she’s kneeling down next to me.\n\n\"I thought you were gonna check out the lake?\" I ask. She ignores me and starts looking at my arm. I feel her nails digging into my skin, and I can’t pull away because her grip is too tight.\n\n\"Ma, you're hurting me.\"\n\n\"Oh, sorry, sweetie,\" she says but still doesn’t let go. She's staring at the boy who knocked me over. Well, more like glaring. My stomach twists as I watch her. She’s baring her teeth and not blinking. I tap her shoulder to try and get her to look away. When she doesn’t respond, I start pulling at her arm. She finally looks back at me and blinks like she just woke up.\n\n\"Want to go get ice cream?\" she asks. I nod, but all I can see is that look in her eyes—like she wanted to make him bleed.\n\nI'm halfway through my ice cream when she says, \"You know I love you, right?\" We've said it a million times, but something about it is off. It reminds me of when my teacher speaks the lyrics to a song in rhythm during music class. Ma’s still talking in rhythm at bedtime.\n\nShe’s reading my favorite book, but all the voices are wrong. When I told her so, she looked like she might cry, so I don’t bring it up again.\n\n***\n\nI wake up to my door creaking. The clock on my nightstand says 2:30 AM. At first, I think I’m dreaming, then I see Ma standing in my doorway. Maybe she came to check on me? But she’s not moving. Not saying anything. I wait for her to say something like, Go back to sleep, Lo, but she doesn’t. She just stares, not blinking again. Something feels wrong. Her arms don’t hang like they usually do. They’re a little too straight, and her fingers are curled like claws. My chest feels tight, and I squeeze my eyes shut. I try to stay really still and start counting my breaths. One… Two… Three… I peek. She’s still there. For some reason, I don’t want her to know I’m awake. I hold my breath. Then, she tilts her head. Too slow. Her neck bends too far. My heart is racing, and my stomach drops like I’m about to get in trouble. I hear the floor creak and feel her freezing cold fingers brush my forehead.\n\n\"My beautiful boy,\" she whispers. \"Mine.\" I count sixty-three breaths before she leaves.\n\n***\n\nThe next morning, Ma makes breakfast wrong. She’s moving real stiff and almost burns the waffles. She puts cinnamon on mine. When she sees my plate is still full, she stares at me.\n\n\"What’s wrong, baby? You love waffles.\" She doesn’t call me baby either, and her voice is too bright, like she’s answering a phone call.\n\n\"Ma, did you not sleep well or something? You know cinnamon gives me a rash.\" Her smile falls slowly, like wax melting off a candle. Her fork clatters against her plate as she throws it down.\n\n\"Come on, we’re leaving for school,\" she snaps, and her fingers curl again. She looks so angry. We still have an hour before we need to leave, but I don’t argue.\n\n***\n\n\"Milo!\" my friend Jake yells. Clearly, he’s called my name a couple of times already. \"You’re not even listening to me!\"\n\n\"Sorry,\" I mumble.\n\n\"Hey, have you noticed something off about Ma?\" Jake comes home with me after school for a couple of hours most days because his mom works late.\n\n\"No, not really. Why?\"\n\n\"Nothing.\" I shake my head and watch my neighbors play Four Square. She’s been acting completely normal, and I’m so confused. I want to tell Jake about it, but what can I say? Hey, my mom looked like she wanted to bite someone and forgot about the allergy I've had since I was a baby?\n\n***\n\nAfter dinner, I’m in the living room with Ma, doing homework. I need to see if I’m imagining things.\n\n\"Hey, Ma,\" I say, putting down my pencil. \"When did I start my coin collection?\"\n\n\"Last year,\" she says, her eyes not leaving the TV. \"It was something you and your dad started after the divorce.\"\n\nWrong. Yeah, Dad sends me coins, but that’s not how it started. When I was seven, we went to Paris with my aunt, and I loved the shiny new coins.\n\n\"What’s my favorite animal?\" I cross my fingers while I wait for her answer.\n\n\"Dogs, of course.\" She laughs for too long. Wrong again. I used to say horses, but my cousin said boys can only like horses if they’re going to be cowboys. Now, I tell people it’s dogs, but Ma knows I still secretly like horses best. Or she used to.\n\n***\n\nI twist a loose thread on my shirt around my fingertip as the phone rings.\n\n\"Hey, kid!\" It feels so good to hear Dad’s voice again. My shoulders relax. \"You excited to come for the summer?\" he asks.\n\n\"Yeah, I am. But can I talk to you about something?\" My finger turns purple, and the thread snaps off.\n\n\"Sure, what’s up?\"\n\n\"I think something’s wrong with Ma.\" I tell him everything, from the park to the messed up breakfast.\n\n\"Kid,\" he sighs, \"you have a wonderful imagination.\"\n\n\"I’m not imagining things!\" I shout. (Am I?) \"Something’s really wrong, I swear.\"\n\n\"How about this? I’ll talk to your mom this weekend and try to see what’s up.\" I can hear him typing on his computer. \"I have to go. You’ve only got a couple more weeks of school, and then you can relax.\"\n\n\"Dad!\" My voice is shrill and still too loud. Silence. Dad didn’t believe me. Maybe no one would. Then, I hear it. A low sound, almost like laughter, coming from down the hallway.\n\nMa’s bathroom light is on, and the door cracked open enough for me to see inside. She’s brushing her hair. But it’s not on her head. At first, I can’t believe what I’m looking at, but there’s a face in the back of her head. It’s covered in matted fur. The mouth is too wide and stretches all the way to her ears. Her grin is uneven, and her pupils are slits. The scariest part is the teeth. They’re long and sharp like knives, and they gleam in the light. I jerk back, and knock into the wall. I want to run to my room, but my legs are frozen, and I can barely breathe. Those eyes lock on me, and Not-Ma's grin somehow gets even wider.\n\n\"What’s wrong, sweetie? You know I love you, right?\"\n\nShe keeps repeating it as I run down the hall, slam my bedroom door, and lock it.\n\nAgain.\n\nAnd again.\n\nAnd again.\n\nLouder and louder until I can barely hear my sobs.\n\n***\n\nIn the middle of the night, I get up to get a glass of water. The light is already on in the kitchen, and I see Not-Ma standing at the sink. She’s smiling and humming to herself, and putting something down the drain. Hesitantly, I step closer. I’m so, so scared. But she's still my mom, right? Then I see the box on the edge of the sink. It’s blue and wooden with velvet lining and compartments inside. It’s the box I keep my coin collection in. My eyes sting with tears and my mouth falls open in horror as I watch her toss each of my coins into the drain, one by one.\n\n\"Ma! What are you doing?\" My voice cracks on the question. She turns to me, still smiling.\n\n\"I know you talked to your father about me.\" For a second, the smile drops, and she’s all sharp, gleaming teeth.\n\n\"You don’t need anyone but me.\"\n\n***\n\nI'm a zombie at school the next day. My teachers are irritated with me, because they have to call my name multiple times, and Jake keeps asking what’s wrong. I need to tell someone. I need someone to believe me. To know I'm not crazy. I keep seeing those teeth and that awful grin every time I close my eyes.\n\n\"It’s Ma. Something’s wrong with her.\"\n\n\"Is she sick?\" Jake asks.\n\n\"Not exactly. She’s just… off.\"\n\n\"Come on, man. You can talk to me. What happened?\"\n\n\"She’s not herself.\" My voice shakes. \"There was this… thing. A face on the back of her head. She’s been watching me sleep. She gave me cinnamon. She’s talking weird.\" Jake looks at me like he thinks I’ve lost it. \"I swear.\" I'm tugging on his sleeve. \"Come over, and I can show you. If I’m wrong, you can make fun of me forever. But if I’m right, you need to see it. Please.\"\n\n\"All right,\" he agrees. He can tell something’s really wrong, even though he doesn’t believe me yet.\n\n***\n\nI’m shaky and nervous later that afternoon. Jake still thinks it’s some kind of joke, but my palms are sweaty, my chest is tight, and I’m jumping at every sound. We're hiding in Ma's closet when the door to her room opens. She's moving normally, but her breathing is ragged and her hands are shaking. She walks to the mirror and takes down her hair.\n\n\"What?\" Jake starts, but I pinch him to stay quiet. Once it’s all off, she picks something up from her dresser and brings it to the back of her head. My mouth goes dry as I watch that face, Not-Ma, bite into a raw steak. Blood drips down its chin, and she chews like she hasn’t eaten in days. Jake holds his breath, trying to stay quiet, but he gasps as she licks the bones clean. Not-Ma freezes for a moment, then I hear the wood groan as she slowly walks towards the closet.\n\nShe drags her nails along the door and calls, \"Are you playing hide and seek? How fun.\" Nothing happens for a second, and I think she'll leave us alone. Then she rips open the door and it slams against the wall. She grabs at us, her skin dry and cold. I yank Jake's wrist, and we run to my room, screaming. My blood pounds in my ears, and I hear her claws scraping the floor as she chases us.\n\nWe lock the door and barricade it with my desk.\n\n\"What the hell was that? What's wrong with her?\" Jake yells. I’m too stunned to speak. She starts banging on the door, screaming. At first, I can’t make out the words over my racing heart.\n\nThen, \"They won't take you away from me! I am everything you need!\"\n\nThe door breaks, pieces of wood flying everywhere. I'm frozen as she grabs Jake and brings his hand to her mouth. I’ll never forget the sound of the bones in his wrist crunching. Or his piercing screams. Ma's face is smiling too, and I start to cry.\n\nI'm stuck staring at a picture of me and Ma from before at the beach. We’re both grinning, and she’s half buried in the sand. I can almost hear the waves. Feel the warm breeze on my neck. It was a perfect day. The metallic smell of blood fills the room, shocking me back into my body. Jake isn’t screaming anymore. Just this long, never ending cry. She didn’t bite off his whole hand. Just mangled it. I grab the picture and throw it at Not-Ma. It clips the side of her head, then hits the window, shattering it. She lets go of Jake in surprise, then grabs the picture. Jake grabs my arm and pulls me out the window with him. The last thing I see before I pass out is Not-Ma staring at the photo and crying.\n\n***\n\nJake ended up with a cast on his hand and his leg. There was no permanent injury, but I know I’ll never see him again. He hasn’t spoken a word. Not even when his mom came to pick him up. Not-Ma made up some story about us playing some crazy hide and seek game and him falling out the window. I don’t know if his mom believed it or not, but they’re moving.\n\n***\n\nIt’s finally summer, and I’m at Dad’s. I still can’t sleep. I wake up screaming in the middle of the night, and sometimes I sleep in bed with Dad even though I’m way too old for it. He knows something is wrong, even though I didn’t tell him what happened. He’s started talking about getting shared custody instead of just visitation rights. When he called Not-Ma to talk about it, the next day I got a package. Inside was the photo. My favorite coin. And a note that said:\n\n\"I am everything you need.\""
}
