{
 "title": "The Doom of Kavzar",
 "chapter": "Excerpt",
 "link": "https://www.scribd.com/document/727233875/Doom-of-Kavzar",
 "description": "A Warhammer Fantasy story about the Doom of Kavzar, a city cursed by a deal with a dark stranger.",
 "text": "Once upon a time, long long ago, Men and Dwarfs lived together beneath the roof of one great city. Some said it was the oldest and greatest city in the world and had existed before the time of the longbeards and manlings, built by older and wiser hands in the dawn of the world. The city lay both above and below the earth, in keeping with the nature of the populace that dwelt there. The Dwarfs ruled in their great halls of stone below ground and wrestled the fruits of the rock free with their day-long toil, while the manlings reaped the fields of swaying corn that surrounded the city with a patchwork blanket of gold. The sun smiled, men laughed, and everyone was happy. One day the men of the city decided that they should give praise to their gods for their good fortunes. They planned a temple such as the world had never seen before. In the central square, a colossal hall would be built and topped with a single, cloud-piercing tower. A tower so tall it would touch the very heart of the heavens. After much planning, and with the help of the longbeards, they set about their monumental task. Weeks became months and months became years and still the manlings built. Men grew old and grey working on that great temple, their sons continuing their work through summer sun and winter rain. At last, after many generations, work began on the great spire itself. Years passed and the tower reached such a height that the manlings found it ever more difficult to take the stone up to the top. Eventually, the work slowed to a crawl, and finishing the tower seemed impossible. Then one came among the men of the city who offered his help in their great scheme. He asked a single boon of them in return and claimed that if they would grant him this, he would complete the tower in a single night. The manlings said to themselves. \"What have we to lose?\" and offered to make a bargain with the grey-clad stranger. All he wished was to add his own dedication to the gods onto the temple structure. The manlings agreed and the bargain was struck. At dusk, the stranger entered the unfinished temple and bade the manlings to return at midnight. Clouds swept over the moons, cloaking the temple in darkness as the manlings left. All over the city, men watched and waited as the hours slipped past until, near midnight, by ones and twos, they gathered again in the temple square. The wind blew and the clouds parted as they gazed up at the temple. It rose like an unbroken lance against the sky, pure and white. At its very peak, a great horned bell hung gleaming coldly in the moonlight. The stranger's dedication to the gods was there but of the stranger himself, there was no sign. The manlings rejoiced that their father's father's work was done They surged forward to enter the temple. Then, at the stroke of midnight, the great bell began to toll, once... twice... thrice. Slow, heavy waves of sound rolled across the city. Four... five... six times the bell rang, like the torpid pulse of a bronze giant. Seven... eight... nine, the rolling of the bell grew louder with each ring, and the manlings staggered back from the temple steps clutching their ears. Ten... eleven... twelve... thirteen. At the thirteenth stroke, lightning split the skies, and thunder echoes through the night. High above, the dark circle of Morrslieb was lit by a bright flash and all fell ominously silent. The manlings fled to their beds, frightened and puzzled by the portents they had seen. The next morning they arose to find that the darkness had come to their city. Brooding storm clouds reared above the rooftops and such rain fell as had never been seen before. Black, like ash, the rain fell and puddled in the streets, slicking the cobbles with darkly iridescent colours. At first, some of the manlings didn't worry, they waited for the rain to stop first, so that they might resume their work. But the rain did not stop, the winds blew stronger and lightning shook the high tower. Days stretched into weeks and still, the rain did not stop. Each night the bell tolled thirteen times and each morning the darkness lay across the city. The manlings became fearful and prayed to their gods. Still, the rains did not stop and the black clouds hung like a shroud over the fields of flattened corn. The Manlings went to the Dwarfs and beseeched their help. The longbeards were unconcerned -- what matter a little rain on the surface? In the bosom of the earth, all was warm and dry. Now the manlings huddled in their dwelling, fear gnawing at their hearts. They sent some of their numbers to faraway places to seek help but none of them returned. Some went to the temple to pray and sacrifice their dwindling food to the gods but they found the temple door closed to them. The rain grew heavier. Dark hailstones fell from the sky and crushed the sodden crops. The great bell tolled a death knell over the terrified city. Soon great stones cleft the heavens, rushing down like dark meteors to smash the homes of the manlings. Many sickened and died from no apparent cause, and the newborn babies of the manlings were hideously twisted. Skulking vermin devoured what little stored corn there was left and the manlings began to starve. The manling elders went to see the Dwarfs again and this time demanded their help. They wanted to bring their folk below ground to safety, they wanted food. The longbeards grew angry and told the manlings that the lower workings were flooded and their food had also been devoured by rats. There remained barely enough food and shelter for them and their kinsmen. They cast the manlings out of their halls and closed their doors once more. In the ruins of the city above, each day became more deadly than the last. The manlings despaired and called for succor from the dark gods, whispered the names of forgotten Daemon Princes in the hope of salvation. But none came -- instead, the vermin returned, bigger and bolder than ever. Their slinking, furred shapes infested the broken city, feasting on the fallen and pulling down the weak. Each midnight the bell tolled thirteen times on high, seeming now brazen and triumphant. The manlings lived as hunted creatures in their own city as great rat packs roamed the streets in search of them. At last, the desperate manlings took up such weapons as they had and beat upon the Dwarfs door, threatening that if they did not emerge they would drag them out by their beards. No reply came from within. The manlings took up beams and battered down the doors to reveal the tunnels below, dark and empty. Steeling themselves, the pitiful remnants of the city's once-proud populace descended. In the ancient hall of kingship, they found the Dwarfs, now naught but gnawed bones and scraps of cloth. And there they saw by the dying light of their torches the myriad eyes about them, glittering like liquid midnight as the rats closed in for the kill. The manlings stood back to back and fought for their lives, but against such implacable ferocity and countless numbers of the verminous horde, their weapons were useless. The tide of monstrous rats flowed over them one by one, dragging them down to be torn apart, the yellow chisel-teeth sinking into their soft flesh, the dark tufted mass drowning their pitiful screams with their hideous chittering....."
}
