{
 "title": "The Last Hunt",
 "chapter": "bioship",
 "link": "https://www.reddit.com/r/40kLore/comments/igarpv/excerptthe_last_hunt_a_human_crew_gets_digested",
 "description": "An excerpt from 'The Last Hunt', a short story by Aaron Dembski-Bowden, published in the anthology 'Tales of Heresy'. The story follows the crew of an augur station as they encounter a tyranid hive fleet.",
 "text": "The vanguard xenos bio-ships had passed by. JUF-D19/Rimward was now at the heart of their fleet. And, compared to the organic drones that quested ahead of the main swarm, the true organisms of the hive fleet were behemoths. Davrick’s mind struggled to comprehend what he was seeing as he took in sheets of pockmarked chitin the size of small continents and toothed orifices the size of cities. The thick clusters of tendrils along its flank and underbelly writhed in the solar winds while its maw was encompassed by two great, wicked, beak-like bone plates that looked as though they could have sheared an Imperial capital ship in half. And the worst thing about the nightmarish leviathan was that it was coming straight towards the augur station. ‘Oh God-Emperor,’ Ankum stammered, over and over. Korday was quietly sobbing, his head in his hands. Sereen just stared, the image on the viewscreen reflected in her wide, dark eyes. Only Crasus turned away from the display. He walked over to the worn leather of his command chair, paused, tugged his dark blue sensorum master’s uniform straight, and sat down. His expression was unreadable, jaw locked, though in the harsh emergency lumens he looked more haggard than ever. ‘Crew members,’ he said, his words cutting through Ankum’s and Korday’s despair. ‘In the past decades of service, it shames me to admit that I have not said this enough. Regardless, if there was ever a time, Throne knows it’s now. It has been an honour to man this station with all of you.’ ‘And with you, chief,’ Davrick said. He was the only one to respond. His own words felt distant, disconnected, as though he was speaking to himself from somewhere far away. His mind was sluggish, unresponsive. His breathing felt laboured. A strange, detached part of his mind supposed that he was probably having a panic attack. Crasus had no more orders to give. He simply sat, watching the viewscreen. Davrick reached out towards his little pict capture of Amilia and Drui, his wife and son, tacked to the side of his monitor. He would see them again, some day. He was sure of it. A fresh surge of stuttered oaths from Ankum distracted him before he could pull the pict off the side of the display. The tyranid bio-ship had filled the viewscreens. Even as the stunned crew watched, the monstrosity’s great, hooked chitin beak split apart. The maw yawned wide, impossibly wide, wide enough – Davrick was sure – to swallow one of Darkand’s moons. Its shadow fell across the augur station, blotting out the light of the stars. The structure around them seemed to shudder, as though its terror matched that of its crew. The viewscreen now showed nothing but static-washed darkness. It had swallowed them whole. Korday had slumped on the deck, shaking and weeping uncontrollably. Crasus was looking down into his lap, knuckles white where he gripped the arms of his chair. Ankum had finally stopped gibbering. ‘Sereen,’ he managed to say, looking over at the augur analyst. ‘Sereen, there’s something I need to tell you…’ She continued to stare at the now-blank viewscreen. A sudden impact threw them all. Davrick found himself sprawling across the deck, almost on top of Korday. The station shook violently, tremors dislodging rune banks and audio systems and sending Davrick’s empty recaff tin bouncing across the deck. The alarms triggered again across the cramped station. Crasus, who alone had managed to stay in his seat, deactivated them without comment. The viewscreen had gone offline completely, showing nothing but grey static. ‘Th-they’re going to board us?’ Ankum stammered as they picked themselves up. Any response was lost in another jarring impact. The station’s frame shrieked in protest at the stresses put upon it. With their systems scrambled and broken it was impossible to tell exactly where they were, or what was happening outside. The station seemed to settle slightly, the sounds of tortured metal reduced to a low creak. They all scanned the ceiling, looking for any sign of a breach. ‘Do you hear that?’ Sereen said. It was the first time she’d spoken since seeing the bio-ship. They all listened, breath held, straining to hear over the groan of adamantium and Korday’s muted sobs. Eventually Davrick caught what Sereen had detected, a faint scratching, scrabbling noise, as though someone – or something – was scraping across the outside of the hull. It mirrored the scratching tormenting all of them from inside their own skulls. ‘They’re on the hull,’ Davrick said. Before he could go on, a crash shattered the breathless quiet. The section directly above Crasus’ chair, in the centre of the station’s cockpit, collapsed. With it came a flood of broiling green liquid that struck Crasus just as he looked up. If the old sensorum master managed to draw breath to scream, the bio-acid flooded his mouth, throat and lungs before he could make a sound. Davrick caught an impression of his death as he was lost entirely in the torrent – flesh sloughing from bones, organics consumed in a heartbeat. The rest of the crew recoiled, but too slowly – Sereen, nearest to the centre of the cockpit, was struck by the acidic spray. Her hands went up to her exposed face, and her screaming filled the claustrophobic space. ‘No!’ Ankum wailed, lunging across his bench to catch the augur analyst as she collapsed. He managed to drag her hands away from her face, then recoiled. Her features had already been reduced to pockmarked bone, her eyeballs running like liquid from their sockets, meat and tendon slipping away with her fingers. Still she screamed. Ankum doubled over and was sick. Davrick, whose station was furthest from Crasus’ chair, scrambled back on top of his bench as the flood of acid spread across the decking plates. Sereen had collapsed into the rising swill, her body coming apart. Ankum tried to push himself against his vox-banks but was sick again, and collapsed. The bugs got to him before the acid. There were insects in the hissing, steaming slime – writhing, sightless maggot-things with hard black shells. They swarmed from the discoloured, vomit-like bio-matter, the air full of the susurration of their passing as they swiftly covered the deck and then the cogitator stations, workbenches and walls, riding the rising tide of acid. First hundreds and then thousands of them reached Ankum, swarming over his boots and knees and up his arms where he was crouched against the vox-systems. He tried to scream, but choked on his own bile. His eyes rolled back into their sockets as the alien swarm began eating him alive. Korday killed himself. Face still streaked with tears, he leapt directly from his bench into the stream that had consumed Crasus and his command chair. He was gone in an instant, as the breach in the station hull was burned wider. As Ankum’s eaten-out remains collapsed into the bio-organics sloshing about the cockpit’s deck, Davrick stood rooted to the top of his bench. He couldn’t think, couldn’t move. He was in the throes of panic – a part of him realised he should end it quickly like Korday, but another part was desperate for another way out, any way out that avoided the nightmare bile that was burning away everything. It was digesting them whole. Even as the terror kept him in place Groll’s binary chair collapsed, pitching the unresponsive tech-adept into the effluvium. His red cloak billowed for a moment before he was lost, coming apart amidst the steaming clouds of liquefied organics. For a moment, Davrick was alone. For a single, ludicrous second, everything felt surreal, ridiculous, almost calm. It had to be a nightmare. None of this horror could possibly be real. Then his bench collapsed. ‘Oh, God-Emperor, no!’ he screamed, trying to scramble back onto the plasteel’s disintegrating remains. ‘No, no, no!’ The bio-acid caught him, sloshing around his boots and his lower fatigues. His panicked wails quickly turned to screams of agony as the material was eaten away, exposing flesh that in turn began to slough off. Muscle and sinew became grey, organic paste, that revealed bone that gave way and splintered beneath its own acid-gnawed weight. Davrick died slowly, on his knees, eaten up inch by inch by the bile and the sightless, burrowing things that swam in it. Eventually the insects flooded his raw throat, choking and suffocating him as they ate out his eyes and bored through his nose and ears and into his brain. The acid took what remained. As another section of the hull caved to emit a fresh gout of vicious toxins, the picture of Amilia and Drui fell from the side of Davrick’s primary viewscreen into the flood. In an instant, the smiling wife and son were gone, consumed entirely."
}
